#include <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");
	int a, b, i = 4, j = 4; //определяем переменные и их тип в программе
	cout << "Значения переменных в самом начале:\n";
	cout << "i = " << i << "\n";
	cout << "j = " << j << "\n";

	cout << "Значения переменных после выполнения a=i++ :\n";
	a = i++;
	cout << "a = " << a << "\n";
	cout << "i = " << i << "\n";

	cout << "Значения переменных после выполнения b=++j :\n";
	b = ++j;
	cout << "b = " << b << "\n";
	cout << "j = " << j << "\n";

	cout << "Значения переменных после выполнения a=(--i)*(i--) :\n";
	a = (--i) * (i--);
	cout << "a = " << a << "\n";
	cout << "i = " << i << "\n";

	cout << "Значения переменных после выполнения b=(--j)*(j--) :\n";
	b = (--j) * (j--);
	cout << "b = " << b << "\n";
	cout << "j = " << j << "\n";

	cout << "Значения переменных после выполнения a=(--i)*(i++) :\n";
	a = (--i) * (i++);
	cout << "a = " << a << "\n";
	cout << "i = " << i << "\n";

	cout << "Значения переменных после выполнения b=(j--)*(++j) :\n";
	b = (j--) * (++j);
	cout << "b = " << b << "\n";
	cout << "j = " << j << "\n";

	cout << "Значения переменных после выполнения a=(--i)*(++i) :\n";
	a = (--i) * (++i);
	cout << "a = " << a << "\n";
	cout << "i = " << i << "\n";
	return 0;
}